In [2]:
%autosave 0

Autosave disabled

In [3]:
import pandas as pd
import numpy as np

from sklearn.linear_model import LogisticRegression
from adam_prepare import titanic_pipeline

Let's read in the data using the titanic pipeline function!

In [4]:
train, val, test = titanic_pipeline()
train.head()

,survived,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,0,19.0,1,0,53.1000,0,1,1,0,0,0,0,1
45,0,29.0,0,0,8.0500,1,1,0,0,1,0,0,1
28,1,29.0,0,0,7.8792,1,0,0,0,1,0,1,0
633,0,29.0,0,0,0.0000,1,1,1,0,0,0,0,1
403,0,28.0,1,0,15.8500,0,1,0,0,1,0,0,1

Let's define a function to create X and y splits of our data.

In [5]:
def xy_split(df):
    
    return df.drop(columns = ['survived']), df.survived

In [6]:
X_train, y_train = xy_split(train)
X_val, y_val = xy_split(val)

X_train.head()  #making sure the survive column is no longer presence

,age,sibsp,parch,fare,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,19.0,1,0,53.1000,0,1,1,0,0,0,0,1
45,29.0,0,0,8.0500,1,1,0,0,1,0,0,1
28,29.0,0,0,7.8792,1,0,0,0,1,0,1,0
633,29.0,0,0,0.0000,1,1,1,0,0,0,0,1
403,28.0,1,0,15.8500,0,1,0,0,1,0,0,1

Now it's time to build our [LogisticRegression](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html) model!

Now it's time to build our 

[LogisticRegression]

(https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.LogisticRegression.html) model!

positive coefficient = 1  => surviving
negative coefficient = 0  => dying

In [11]:
seed = 42

logreg = LogisticRegression(random_state = seed, max_iter = 400) 
#when it went through enough passes, it got an acceptable equation to model my data
#this is the max iteration hyperparameter
logreg.fit(X_train, y_train)

logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.7993579454253612, 0.8507462686567164)

In [8]:
logreg.coef_

array([[-0.04112725, -0.49163651, -0.17282425,  0.00258418, -0.61525169,
        -2.46916127,  1.02280468,  0.10287352, -0.96632969, -0.15632547,
         0.21239474, -0.42305149]])

In [9]:
pd.DataFrame({'feature': X_train.columns,
              'coefficient': logreg.coef_[0]})

                    feature  coefficient
0                       age    -0.041127
1                     sibsp    -0.491637
2                     parch    -0.172824
3                      fare     0.002584
4                     alone    -0.615252
5                  sex_male    -2.469161
6               class_First     1.022805
7              class_Second     0.102874
8               class_Third    -0.966330
9     embark_town_Cherbourg    -0.156325
10   embark_town_Queenstown     0.212395
11  embark_town_Southampton    -0.423051

In [13]:
seed = 42
logreg= LogisticRegression(random_state = seed,
                          max_iter = 400,
                          solver = 'liblinear',
                           penalty ='l1')  #this is L1 no 11
logreg.fit(X_train, y_train)
logreg.score(X_train, y_train), logreg.score(X_val, y_val)

(0.8009630818619583, 0.8507462686567164)

In [14]:
pd.DataFrame({'feature': X_train.columns, 
             'coefficient': logreg.coef_[0]})

                    feature  coefficient
0                       age    -0.038327
1                     sibsp    -0.418894
2                     parch    -0.136355
3                      fare     0.002931
4                     alone    -0.434766
5                  sex_male    -2.530612
6               class_First     1.966966
7              class_Second     1.009704
8               class_Third     0.000000
9     embark_town_Cherbourg     0.000000
10   embark_town_Queenstown     0.269433
11  embark_town_Southampton    -0.223258

In [ ]:
#class third has no coefficient at all